#ifndef __PROTOCOL_H_
#define __PROTOCOL_H_

#include <stdbool.h>

/******************************************************************************
                           用户相关信息配置
******************************************************************************/
/******************************************************************************
                       1:修改产品信息
******************************************************************************/
#define PK_PS "p11pjq_N2ZDQmtRa0pNQktt"      //在开发者中心创建产品生成的生成的产品唯一标识和对应的密钥，两者通过下划线连接

/****************************************************************************
                       可选的配置
***************************************************************************/


#define TSL_ID_LEN "1"                         // TSL ID 长度，0： 1字节，1：2字节

#define WIFI_NET_CONFIG_MODE "1"               // WIFI 配网模式，0： 常配网工作模式，1：超时配网工作模式

#define WIFI_MT "3"                           // WiFi 设置超时配网工作模式的状态切换时间（单位：分钟），可以支持的设置时间范围：3 分钟-10 分钟。

/******************************************************************************
                          2:MCU是否需要支固件升级
如需要支持MCU固件升级,请开启该宏
MCU可调用mcu_api.c文件内的mcu_firm_update_query()函数获取当前MCU固件更新情况
                        ********WARNING!!!**********
当前接收缓冲区为关闭固件更新功能的大小,固件升级包可选择，默认256字节大小
如需要开启该功能,串口接收缓冲区会变大
******************************************************************************/
#define         SUPPORT_MCU_FIRM_UPDATE             //开启MCU固件升级功能(默认关闭)
#define			SUPPORT_MULTI_COMPONENT				//开启多组件升级功能

#ifdef SUPPORT_MCU_FIRM_UPDATE		 //用户的软件版本,用于MCU固件升级,MCU升级版本需修改
/* 设置多MCU的版本 */
#if defined(SUPPORT_MULTI_COMPONENT)
	#define MCU_VER "\",\"v_list\":{\"MCUA\":\"1.0.1\",\"MCUB\":\"1.0.2\",\"MCUC\":\"1.0.3\"}"
#else
	#define MCU_VER "\",\"v\":\"1.0.0\""
#endif
#endif

/*  Firmware package size selection  */
#ifdef SUPPORT_MCU_FIRM_UPDATE
#define PACKAGE_SIZE                   1        //包大小 0:256字节 1:512字节 2:1024字节
#define FIRMWARE_PACKAGE_SIZE          ((1<<PACKAGE_SIZE)*256)
#endif

/******************************************************************************
                         3:定义收发缓存:
                    如当前使用MCU的RAM不够,可修改为24
******************************************************************************/
#ifndef SUPPORT_MCU_FIRM_UPDATE

#define WIFI_UART_RECV_BUF_LMT          1024              //串口数据接收缓存区大小,如MCU的RAM不够,可缩小
#define WIFI_DATA_PROCESS_LMT           1024              //串口数据处理缓存区大小,根据用户TSL数据大小量定,必须大于24

#else

#define WIFI_UART_RECV_BUF_LMT          1024             //串口数据接收缓存区大小,如MCU的RAM不够,可缩小

//请在此处选择合适的串口数据处理缓存大小（根据上面MCU固件升级包选择的大小选择开启多大的缓存）
#define WIFI_DATA_PROCESS_LMT        ((1<<PACKAGE_SIZE)*300)             //串口数据处理缓存大小,如需MCU固件升级,若单包大小选择256,则缓存必须大于260

#endif

#define WIFIR_UART_SEND_BUF_LMT         1024              //根据用户需要发送的物模型数据大小量定,必须大于48


/******************************************************************************
                      4:MCU是否需要支持校时功能
如需要请开启该宏,并在Protocol.c文件内mcu_write_rtctime实现代码
mcu_write_rtctime内部有#err提示,完成函数后请删除该#err
mcu在wifi模块正确联网后可调用mcu_get_system_time()函数发起校时功能
******************************************************************************/
#define         SUPPORT_MCU_RTC_CHECK                //开启校时功能

/******************************************************************************
                      5:MCU是否需要支持wifi功能测试
如需要请开启该宏,并且mcu在需要wifi功能测试处调用mcu_api.c文件内mcu_start_wifitest
并在protocol.c文件wifi_test_result函数内查看测试结果,
wifi_test_result内部有#err提示,完成函数后请删除该#err
******************************************************************************/
#define         WIFI_TEST_ENABLE                //开启WIFI产测功能（扫描指定路由）

/******************************************************************************
                      6:MCU是否需要开启获取当前WIFI联网状态功能
如需要请开启该宏,并且mcu在需要获取当前WIFI联网状态处调用mcu_api.c文件内mcu_get_wifi_connect_status
并在protocol.c文件wifi_test_result函数内查看结果,
wifi_test_result内部有#err提示,完成函数后请删除该#err
******************************************************************************/
#define         GET_WIFI_STATUS_ENABLE                  //开启获取当前WIFI联网状态功能

/******************************************************************************
                      7:MCU是否需要开启获取模块mac地址功能
如需要请开启该宏,并且mcu在需要获取模块mac地址处调用mcu_api.c文件内mcu_get_module_mac
并在protocol.c文件mcu_get_mac函数内查看结果,
mcu_get_mac内部有#err提示,完成函数后请删除该#err
******************************************************************************/
#define         GET_MODULE_MAC_ENABLE                   //开启获取模块mac地址功能

/******************************************************************************
                      8:MCU是否需要支持获取格林时间功能
如需要请开启该宏,并且mcu在需要获取格林时间处调用mcu_api.c文件内mcu_get_green_time
并在protocol.c文件mcu_get_greentime函数内查看结果,
mcu_get_greentime内部有#err提示,完成函数后请删除该#err
mcu在wifi模块正确联网后可调用mcu_get_green_time()函数发起校时功能
******************************************************************************/
#define         SUPPORT_GREEN_TIME                //开启格林时间功能

/******************************************************************************
                      9:MCU是否需要开启同步状态上报功能
1) 此命令为同步指令，MCU 数据状态上报后，需要等待模块返回结果；
2) 每次发送模组都会有响应，WIFI 模组未响应前不可多次上报；
3) 网络不好，数据难以及时上报时，模块会在 5 后返回失败，MCU 需要等待大于 5 秒。
******************************************************************************/
//#define         MCU_TSL_UPLOAD_SYN                   //开启同步状态上报功能






/******************************************************************************
                        10:物模型序列号重新定义
                        此处数据请和移远平台创建的功能点一致      
******************************************************************************/
// #error "请将功能点ID与平台上设置的保持一致,并删除该行"


/**
 * @brief  串口发送数据
 * @param[in] {value} 串口要发送的1字节数据
 * @return Null
 */
void uart_transmit_output(unsigned char value);



#endif
